wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_merkle_damgard_engine.h
/**
*********************************************************************************************************
*               Copyright(c) 2018, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* @file      rtl876x_merkle_damgard_engine.h
* @brief     this is the driver for sha2 and sm3 combo mode
* @details   only supports sha2-224, sha2-256 and sm3, and supports external DMA mode
* @author    kunhsuan wu
* @date      2023-07-18
* @version   v0.1
* *********************************************************************************************************
*/

#ifndef __RTL876X_MERKLE_DAMGARD_ENGINE_H
#define __RTL876X_MERKLE_DAMGARD_ENGINE_H

#ifdef __cpluspuls
extern "C" {
#endif
    /* Includes ------------------------------------------------------------------*/
#include <stdbool.h>
#include "rtl876x.h"
#include "mde_config.h"

    /**
      * @brief reference to CTC hmac engine register table
      */
    typedef struct
    {
        /* the byte inversion example:
         *
         *                   addr   3    2    1    0
         *                    4   0x7a 0xaa 0x21 0x22
         *                    0   0xee 0xfe 0x97 0xad
         *
         *  if xxx_byte_inversion_en = 1
         *      the data input to the engine will be 0xad97feee2221aa7a
         *  if xxx_byte_inversion_en = 0
         *      the data input to the engine will be 0x7aaa2122eefe97ad
         */
        union
        {
            __IO uint32_t Control; // 0x00, control register
            struct
            {
                __IO uint32_t sha2_mode: 2;     // [1:0] 0: sha2-224, 1: sha2-256, 2: sha2-384, 3: sha2-512
                __IO uint32_t dma_mode: 1;      // [2] 0: read-only mode, 1: copy mode, only use read only mode
                __IO uint32_t sha1_mode: 1;     // [3] 0: non-sha1 mode, 1: sha1 mode if sm3_mode is 0
                __IO uint32_t hmac_mode: 1;     // [4] 0: hash mode, 1: hmac mode
                __IO uint32_t icg_enable: 1;    // [5]: enable auto clock gating
                __IO uint32_t slave_mode: 1;    /* [6] 0: internal dma mode, 1: slave(cpu) mode,
                                             *      hw is fixed 1 if configured to ext dma */
                __IO uint32_t sm3_mode: 1;      // [7] 0: non-sm3 mode, 1: sm3 mode
                __IO uint32_t hmac_key_size: 2; // [9:8] 0: 128 bits, 1: 192 bits, 2: 256 bits
                __IO uint32_t sha512_truncate_en: 1; // [10] 0: normal sha2-512, 1: truncated sha2-512
                __IO uint32_t sha512t256_mode: 1;   // [11] 0: sha2-512/224, 1: sha2-512/256
                __IO uint32_t payload_byte_inversion_en: 1; // [12] 0: high address as MSB, 1: low address as MSB
                __IO uint32_t key_byte_inversion_en: 1; // [13] 0: high address as MSB, 1: low address as MSB
                __IO uint32_t fifo_full_suspend: 1; // [14] 0: high address as MSB, 1: low address as MSB
                __I uint32_t rsvd0: 9;
                __IO uint32_t software_reset: 1; // [24]: trigger software reset, read this bit until 0
                __I uint32_t rsvd1: 7;
            } Control_fields;
        };
        union
        {
            __I uint32_t Status; // 0x04, status register
            struct
            {
                __I uint32_t fifo_left_size: 5; // [4:0]: record left size in hw fifo
                __I uint32_t rsvd0: 23;
                __I uint32_t sha_core_busy: 1;  // [28] 1: engine busy
                __I uint32_t rsvd: 3;
            } Status_fields;
        };
        union
        {
            __IO uint32_t BlockCtrl; // 0x08, BlockCtrl register
            struct
            {
                __IO uint32_t first_block: 1;    /* [0]: this operation is the first block,
                                                        if sha/sm3 mode, the digest will be initialized
                                                        if hmac mode, the i_pad will be executed first
                                                        this bit automatically cleared by hardware */
                __IO uint32_t last_block: 1;     /* [1]: this operation is the last block,
                                                        if sha/sm3 mode, the padding step will be executed at the end
                                                        if hmac mode, the o_pad will be executed at the end
                                                        this bit should be cleared by software */
                __IO uint32_t end_slave_input: 1;// [2]: if all input data is completed, set 1 to start padding
                __I uint32_t rsvd: 29;
            } BlockCtrl_fields;
        };
        __I uint32_t Reserved;  // 0x0C

        /* The IV/digest regsiters of SHA2-224/256, SM3 are 32-bit
         * H0 = SHA digest register 0
         * H1 = SHA digest register 2
         * H2 = SHA digest register 4
         * H3 = SHA digest register 6
         * H4 = SHA digest register 8
         * H5 = SHA digest register 10
         * H6 = SHA digest register 12
         * H7 = SHA digest register 14
         * since SHA2-224/256, SM3 use 32-bit, the digest register 1, 3, 5... should be set to 0 if use
            SW to setup initial hash value

         * The IV/digest regsiters of SHA2-384/512 are 64-bit
         * H0 = SHA digest register 0 || SHA digest register 1
         * H1 = SHA digest register 2 || SHA digest register 3
         * H2 = SHA digest register 4 || SHA digest register 5
         * H3 = SHA digest register 6 || SHA digest register 7
         * H4 = SHA digest register 8 || SHA digest register 9
         * H5 = SHA digest register 10 || SHA digest register 11
         * H6 = SHA digest register 12 || SHA digest register 13
         * H7 = SHA digest register 14 || SHA digest register 15
         *
         * The hash value is H0 || H1 || H2 || H3 || H4 || H5 || H6 || H7
         * || means concatenate

         * Software can reset digest registers by setting BlockCtrl[0] after setting SHA mode
         */
        union
        {
            __IO uint32_t digest[16]; // 0x10 ~ 0x4c, reset is SHA384 iv
            struct
            {
                __IO uint32_t SHA_DIGEST_0;     // 0x10, hash value 0 MSB
                __IO uint32_t SHA_DIGEST_1;     // 0x14, hash value 0 LSB
                __IO uint32_t SHA_DIGEST_2;     // 0x18, hash value 1 MSB
                __IO uint32_t SHA_DIGEST_3;     // 0x1c, hash value 1 LSB
                __IO uint32_t SHA_DIGEST_4;     // 0x20, hash value 2 MSB
                __IO uint32_t SHA_DIGEST_5;     // 0x24, hash value 2 LSB
                __IO uint32_t SHA_DIGEST_6;     // 0x28, hash value 3 MSB
                __IO uint32_t SHA_DIGEST_7;     // 0x2c, hash value 3 LSB
                __IO uint32_t SHA_DIGEST_8;     // 0x30, hash value 4 MSB
                __IO uint32_t SHA_DIGEST_9;     // 0x34, hash value 4 LSB
                __IO uint32_t SHA_DIGEST_10;    // 0x38, hash value 5 MSB
                __IO uint32_t SHA_DIGEST_11;    // 0x3c, hash value 5 LSB
                __IO uint32_t SHA_DIGEST_12;    // 0x40, hash value 6 MSB
                __IO uint32_t SHA_DIGEST_13;    // 0x44, hash value 6 LSB
                __IO uint32_t SHA_DIGEST_14;    // 0x48, hash value 7 MSB
                __IO uint32_t SHA_DIGEST_15;    // 0x4c, hash value 7 LSB
            } digest_fields;
        };
        __O uint32_t FIFO_DATA; // 0x50, fifo data register for slave mode

