wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_merkle_damgard_engine.h
        __I uint32_t Reserved1[3];  // 0x54 ~ 0x5C

        union
        {
            __IO uint32_t hmac_key[8]; // 0x60 ~ 0x7c
            struct
            {
                __IO uint32_t HMAC_KEY_0;     // 0x60, hmac key[255:224]
                __IO uint32_t HMAC_KEY_1;     // 0x64, hmac key[223:192]
                __IO uint32_t HMAC_KEY_2;     // 0x68, hmac key[191:160]
                __IO uint32_t HMAC_KEY_3;     // 0x6c, hmac key[159:128]
                __IO uint32_t HMAC_KEY_4;     // 0x70, hmac key[127:96]
                __IO uint32_t HMAC_KEY_5;     // 0x74, hmac key[95:64]
                __IO uint32_t HMAC_KEY_6;     // 0x78, hmac key[63:32]
                __IO uint32_t HMAC_KEY_7;     // 0x7c, hmac key[31:0]
            } hmac_key_fields;
        };

        union
        {
            /* if hmac mode, fill the length with ipad and opad,
             * e.g,: 0x40 if sha2-224/256, 0x80 if sha2-384/512
             */
            __IO uint32_t hash_input_len[4]; // 0x80 ~ 0x8c, hash total byte len
            struct
            {
                __IO uint32_t HASH_input_len_0; // 0x80, hash input byte len [127:96]
                __IO uint32_t HASH_input_len_1; // 0x84, hash input byte len [95:64]
                __IO uint32_t HASH_input_len_2; // 0x88, hash input byte len [63:32]
                __IO uint32_t HASH_input_len_3; // 0x8c, hash input byte len [31:0]
            } hash_input_len_fields;
        };

        __I uint32_t Reserved2[28];  // 0x90 ~ 0xFC

        union
        {
            __IO uint32_t sha256_digest_alias[8]; // 0x100 ~ 0x11c
            struct
            {
                __IO uint32_t SHA256_DIGEST_ALIAS_0;     // 0x100, sha256 hash value 0
                __IO uint32_t SHA256_DIGEST_ALIAS_1;     // 0x104, sha256 hash value 1
                __IO uint32_t SHA256_DIGEST_ALIAS_2;     // 0x108, sha256 hash value 2
                __IO uint32_t SHA256_DIGEST_ALIAS_3;     // 0x10c, sha256 hash value 3
                __IO uint32_t SHA256_DIGEST_ALIAS_4;     // 0x110, sha256 hash value 4
                __IO uint32_t SHA256_DIGEST_ALIAS_5;     // 0x114, sha256 hash value 5
                __IO uint32_t SHA256_DIGEST_ALIAS_6;     // 0x118, sha256 hash value 6
                __IO uint32_t SHA256_DIGEST_ALIAS_7;     // 0x11c, sha256 hash value 7
            } sha256_digest_alias_fields;
        };

        union
        {
            __IO uint32_t DMA_HS_Config; // 0x120, DMA handshake config register
            struct
            {
                __IO uint32_t dma_hs_tr_width: 3;   /* [2:0]: The expected data width of each write transaction
                                                              from DMA. Since the engine used the APB protocol,
                                                              please set the field to 3'b010 */
                __IO uint32_t dma_hs_msize: 3;      /* [5:3]: The expected number of burst write transaction length
                                                              Please set this field to 3'b000 to avoid data loss */
                __I uint32_t rsvd: 26;
            } DMA_HS_Config_fields;
        };

        __IO uint32_t dma_hs_block_ts; // 0x124, Total data bytes for requesting DMA

        union
        {
            __IO uint32_t DMA_HS_buffer_byte; // 0x128, DMA handshake buffer byte register
            struct
            {
                __IO uint32_t dma_hs_buffer_byte: 8;    /* [7:0]: This register indicates the data bytes
                                                                  processed in engine. This number will not
                                                                  larger than block size of engine */
                __I uint32_t rsvd: 24;
            } DMA_HS_buffer_byte_fields;
        };

        union
        {
            __IO uint32_t DMA_HS_EN; // 0x12C, DMA handshake enable register
            struct
            {
                __IO uint32_t dma_hs_en: 1;    /* [0]: Once the register is enabled,
                                                       the engine starts to send the request to the DMA until
                                                       all the data being transferred, automatically cleared by hardware */
                __I uint32_t rsvd: 31;
            } DMA_HS_EN_fields;
        };

        __I uint32_t Reserved3[756];  // 0x130 ~ 0xCFC

        union
        {
            __IO uint32_t Mutex_status; // 0xD00, mutex status register
            struct
            {
                __IO uint32_t engine_mutex_status: 2;    /* [1:0]: if read 0, lock mutex,
                                                        if not 0, the engine is being used
                                                        0x1: secure domain lock mutex,
                                                        0x2: non secure domain lock mutex
                                                        write 0 to unlock mutex*/
                __I uint32_t rsvd: 30;
            } Mutex_status_fields;
        };

        union
        {
            __IO uint32_t Mutex_overwrite; // 0xD04, mutex overwrite register
            struct
            {
                __IO uint32_t engine_mutex_overwrite: 1;    /* [0]: allow secure domain overwrite mutex,
                                                           0: enable,
                                                           1: disable*/
                __I uint32_t rsvd: 31;
            } Mutex_overwrite_fields;
        };

        __I uint32_t Reserved4[186];  // 0xD08 ~ 0xFEC

        union
        {
            __I uint32_t Configuration; // 0xFF0, Configuration register
            struct
            {
                __I uint32_t sha2_core_en: 1;               /* [0] 0: disabled, 1: enabled */
                __I uint32_t support_sha512: 1;             /* [1] 0: disabled, 1: enabled */
                __I uint32_t support_truncated_sha512: 1;   /* [2] 0: disabled, 1: enabled */
                __I uint32_t support_hmac_mode: 1;          /* [3] 0: disabled, 1: enabled */
                __I uint32_t support_copy_mode: 1;          /* [4] 0: disabled, 1: enabled */
                __I uint32_t external_key_en: 1;            /* [5] 0: disabled, 1: enabled */
                __I uint32_t trustzone_en: 1;               /* [6] 0: disabled, 1: enabled */
                __I uint32_t sha1_core_en: 1;               /* [7] 0: disabled, 1: enabled */
                __I uint32_t sm3_core_en: 1;                /* [8] 0: disabled, 1: enabled */
                __I uint32_t rsvd0: 2;
                __I uint32_t disable_core_sha2: 1;          /* [12] 0: disabled, 1: enabled */
                __I uint32_t disable_core_sha1: 1;          /* [13] 0: disabled, 1: enabled */
                __I uint32_t disable_core_sm3: 1;           /* [14] 0: disabled, 1: enabled */
                __I uint32_t rsvd: 17;
            } Configuration_fields;
        };

        __I uint32_t Reserved5;  // 0xFF4

        union
        {
            __I uint32_t Version; // 0xFF8, Version register
            struct
            {
                __I uint32_t engine_version: 16;
                __I uint32_t svn_number: 16;
            } Version_fields;
        };

        union
        {
            __I uint32_t Date; // 0xFFC, Date register
            struct
            {
                __I uint32_t date: 16;
                __I uint32_t year: 16;
            } Date_fields;
        };
    } HW_MDE_CTRL_TypeDef;

#if MDE_SUPPORT_INT_DMA_EN == 1
    typedef struct
    {
        __IO uint32_t SAR0;             // 0x00, source address
        __IO uint32_t Reserved0;        // 0x04
        __IO uint32_t DAR0;             // 0x08, destination address
        __IO uint32_t Reserved1[3];     // 0x0C~0x14

        union
        {
            __IO uint32_t CTRL0;        // 0x18, low part of control register, default: 0x4801
            struct
            {
                __IO uint32_t int_en: 1;        // [0]: interrupt enable
                __IO uint32_t dst_tr_width: 3;  // [3:1]: destination transfer width, should be 0x0(8-bit)
                __IO uint32_t src_tr_width: 3;  // [6:4]: source transfer width, should be 0x0(8-bit)
                __IO uint32_t DINC: 2;          /* [8:7]: destination address increment,
                                                      should be 0x0 for increment mode */
                __IO uint32_t SINC: 2;          /* [10:9]: source address increment,
                                                       should be 0x0 for increment mode */
                __IO uint32_t DEST_MSIZE: 3;    /* [13:11]: destination burst length,
                                                        for ro mode: don't care
                                                        for rw mode: must be 0x0(single) */
                __IO uint32_t SRC_MSIZE: 3;     /* [16:14]: source burst length,
                                                        for sha224/256: should be 0x2(burst 8)
                                                        for sha384/512: should be 0x3(burst 16) */
                __IO uint32_t rsvd: 15;
            } CTRL0_fields;
        };

        union
        {
            __O uint32_t CTRL0_block_ts;   // 0x1C, high part of control register
            struct
            {
                __O uint32_t block_ts: 19;     /* [18:0]: block transfer size (block count * src msize),
                                                      should be multiple SHA2 blocks
                                                      maximum block transfer size is according to
                                                      MDE_MAX_DMA_BUF_BLOCK_SIZE */
                __O uint32_t rsvd: 13;
            } CTRL0_block_ts_fields;
        };

        __IO uint32_t Reserved2[9];     // 0x20~0x40

        union
        {
            __IO uint32_t CFG0;         // 0x44, high part of config register, defualt: 0x8
            struct
            {
                __IO uint32_t rsvd0: 3;
                __IO uint32_t PROTCTL: 1;       /* [3]: security control (AxPROT[1])
                                                    0: secure DMA transfer, 1: non-secure DMA transfer */
                __IO uint32_t rsvd1: 28;
            } CFG0_fields;
        };

        __IO uint32_t Reserved3[168];   // 0x48~0x2E4

        union
        {
            __IO uint32_t StatusTfr;      // 0x2E8
            struct
            {
                __I uint32_t status_tfr: 8;     // [7:0]: transfer status of each channel
                __IO uint32_t rsvd: 24;
            } StatusTfr_fields;
        };

