wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_merkle_damgard_engine.h
        __IO uint32_t Reserved4[9];   // 0x2EC~0x30C

        union
        {
            __IO uint32_t MaskTfr;      // 0x310
            struct
            {
                __IO uint32_t INT_MASK: 1;      // [0]: interrupt mask, 0: masked, 1: unmasked
                __IO uint32_t rsvd0: 7;
                __O uint32_t INT_MASK_WE: 1;    // [8]: interrupt mask write enable
                __IO uint32_t rsvd1: 23;
            } MaskTfr_fields;
        };

        __IO uint32_t Reserved5[9];     // 0x314~0x334

        union
        {
            __O uint32_t ClearTfr;      // 0x338
            struct
            {
                __O uint32_t ClearTfr: 1;      // [0]: write 1 to clear transfer complete interrupt (TFR)
                __O uint32_t rsvd0: 31;
            } ClearTfr_fields;
        };

        __IO uint32_t Reserved6[9];     // 0x33C~0x35C

        union
        {
            __I uint32_t StatusInt;     // 0x360
            struct
            {
                __I uint32_t TFR: 1;        // [0]: DMA transfer complete
                __I uint32_t BLOCK: 1;      // [1]: block transfer complete (masked, unused)
                __I uint32_t SRCT: 1;       // [2]: SCR transfer complete (masked, unused)
                __I uint32_t DSTT: 1;       // [3]: DST transfer complete (masked, unused)
                __I uint32_t ERR: 1;        // [4]: bus transfer error
                __I uint32_t rsvd0: 27;
            } StatusInt_fields;
        };

        __IO uint32_t Reserved7[13];    // 0x364~0x394

        union
        {
            __IO uint32_t DmaCfgReg;    // 0x398
            struct
            {
                __IO uint32_t DMA_EN: 1;        // [0] 0: DMA disabled, 1: DMA enabled
                __IO uint32_t rsvd0: 31;
            } DmaCfgReg_fields;
        };

        __IO uint32_t Reserved8;        // 0x39C

        union
        {
            __IO uint32_t ChEnReg;      // 0x3A0
            struct
            {
                __IO uint32_t CH_EN: 1;         /* [0]: enable dma channel, 0: disable, 1: enable
                                                    this bit is automatically cleared by hw to
                                                    disable the channel after DMA transfer completed
                                                    sw can poll this bit to determine when this
                                                    channel is done */
                __IO uint32_t rsvd0: 7;
                __O uint32_t CH_EN_WE: 1;       // [8]: channel enable write enable
                __IO uint32_t rsvd1: 23;
            } ChEnReg_fields;
        };
    } HW_MDE_DMA_TypeDef;

#define MDE_DMA                         ((HW_MDE_DMA_TypeDef *) MDE_DMA_BASE_ADDR)

#define MDE_DMA_CH_EN_WE                (BIT8)
#define MDE_DMA_CH_EN                   (BIT0)
#endif

#define MDE_CTRL                        ((HW_MDE_CTRL_TypeDef *) MDE_CTRL_BASE_ADDR)
#define MDE_FIFO_OFFSET                 (0x50)
#define MDE_ENGINE_FIFO_INPUT           (MDE_CTRL_BASE_ADDR + MDE_FIFO_OFFSET)

#define MDE_PAD_FIRST                   (0x80)
#define MDE_HASH_BYTE_LEN_REG_LEN       4

#define SHA1_BLOCK_BYTE_SIZE            (64)
#define SHA1_BLOCK_BIT_SIZE             (512)
#define SHA2_224_BLOCK_BYTE_SIZE        (64)
#define SHA2_224_BLOCK_BIT_SIZE         (512)
#define SHA2_256_BLOCK_BYTE_SIZE        (64)
#define SHA2_256_BLOCK_BIT_SIZE         (512)
#define SHA2_384_BLOCK_BYTE_SIZE        (128)
#define SHA2_384_BLOCK_BIT_SIZE         (1024)
#define SHA2_512_BLOCK_BYTE_SIZE        (128)
#define SHA2_512_BLOCK_BIT_SIZE         (1024)
#define SM3_BLOCK_BYTE_SIZE             (64)
#define SM3_BLOCK_BIT_SIZE              (512)

#define SHA1_DIGEST_BYTE_SIZE           20
#define SHA2_224_DIGEST_BYTE_SIZE       28
#define SHA2_256_DIGEST_BYTE_SIZE       32
#define SHA2_384_DIGEST_BYTE_SIZE       48
#define SHA2_512_DIGEST_BYTE_SIZE       64
#define SM3_DIGEST_BYTE_SIZE            32

#define MDE_DEBUG_LOG 0
#if (MDE_DEBUG_LOG == 1)
#define MDE_LOG(...) DBG_DIRECT(__VA_ARGS__)
#else
#define MDE_LOG(...)
#endif

    typedef enum
    {
        HW_MDE_DMA_MODE = 0,
        HW_MDE_CPU_MODE = 1
    } HW_MDE_ACCESS_MODE;

    typedef enum
    {
        HW_MDE_HASH_ALGO_SM3          = 0x0,
        HW_MDE_HASH_ALGO_SHA1         = 0x1,
        HW_MDE_HASH_ALGO_SHA2_224     = 0x2,
        HW_MDE_HASH_ALGO_SHA2_256     = 0x3,
        HW_MDE_HASH_ALGO_SHA2_384     = 0x4,
        HW_MDE_HASH_ALGO_SHA2_512     = 0x5,
        HW_MDE_HASH_ALGO_SHA2_512t224 = 0x6,
        HW_MDE_HASH_ALGO_SHA2_512t256 = 0x7,

        HW_MDE_HASH_ALGO_MAX          = 0x8,

        HW_MDE_HMAC_ALGO_SM3          = 0x100,
        HW_MDE_HMAC_ALGO_SHA1         = 0x101,
        HW_MDE_HMAC_ALGO_SHA2_224     = 0x102,
        HW_MDE_HMAC_ALGO_SHA2_256     = 0x103,
        HW_MDE_HMAC_ALGO_SHA2_384     = 0x104,
        HW_MDE_HMAC_ALGO_SHA2_512     = 0x105,
        HW_MDE_HMAC_ALGO_SHA2_512t224 = 0x106,
        HW_MDE_HMAC_ALGO_SHA2_512t256 = 0x107,

    } HW_MDE_ALGO;

    typedef enum
    {
        HW_MDE_KEY_128 = 128,
        HW_MDE_KEY_192 = 192,
        HW_MDE_KEY_256 = 256,
    } HW_MDE_KEY_SIZE_SEL;

    typedef union
    {
        uint64_t bit_len[2];
        uint8_t bit_len_arr[16];
    } Bit_len_TypeDef;

    typedef struct
    {
        uint64_t total[2];           /*!< The number of Bytes processed.  */
        uint32_t state[16];          /*!< The intermediate digest state. */
        uint8_t buffer[128];         /*!< The data block being processed. */
        HW_MDE_ALGO algo;            /*!< hash algorithm */
    } MDE_CTX;

    __STATIC_INLINE uint32_t hw_mde_get_iv_len(HW_MDE_ALGO algo)
    {
        HW_MDE_ALGO hash_algo = (algo & 0xff);

        uint32_t iv_byte_len_array[HW_MDE_HASH_ALGO_MAX] =
        {
            SM3_DIGEST_BYTE_SIZE,
            SHA1_DIGEST_BYTE_SIZE,
            SHA2_256_DIGEST_BYTE_SIZE,  // sha2 224 is also 32 byte iv
            SHA2_256_DIGEST_BYTE_SIZE,
            SHA2_512_DIGEST_BYTE_SIZE,  // sha2 384 is also 64 byte iv
            SHA2_512_DIGEST_BYTE_SIZE,
            SHA2_512_DIGEST_BYTE_SIZE,  // sha2 512t224 is also 64 byte iv
            SHA2_512_DIGEST_BYTE_SIZE,  // sha2 512t256 is also 64 byte iv
        };

        return iv_byte_len_array[hash_algo];
    }

