wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_merkle_damgard_engine.h
    __STATIC_INLINE uint32_t hw_mde_get_digest_len(HW_MDE_ALGO algo)
    {
        HW_MDE_ALGO hash_algo = (algo & 0xff);

        uint32_t digest_byte_len_array[HW_MDE_HASH_ALGO_MAX] =
        {
            SM3_DIGEST_BYTE_SIZE,
            SHA1_DIGEST_BYTE_SIZE,
            SHA2_224_DIGEST_BYTE_SIZE,
            SHA2_256_DIGEST_BYTE_SIZE,
            SHA2_384_DIGEST_BYTE_SIZE,
            SHA2_512_DIGEST_BYTE_SIZE,
            SHA2_224_DIGEST_BYTE_SIZE,
            SHA2_256_DIGEST_BYTE_SIZE,
        };

        return digest_byte_len_array[hash_algo];
    }

    __STATIC_INLINE uint32_t hw_mde_get_block_byte_len(HW_MDE_ALGO algo)
    {
        HW_MDE_ALGO hash_algo = (algo & 0xff);

        uint32_t block_byte_len_array[HW_MDE_HASH_ALGO_MAX] =
        {
            SM3_BLOCK_BYTE_SIZE,
            SHA1_BLOCK_BYTE_SIZE,
            SHA2_224_BLOCK_BYTE_SIZE,
            SHA2_256_BLOCK_BYTE_SIZE,
            SHA2_384_BLOCK_BYTE_SIZE,
            SHA2_512_BLOCK_BYTE_SIZE,
            SHA2_512_BLOCK_BYTE_SIZE,
            SHA2_512_BLOCK_BYTE_SIZE,
        };

        return block_byte_len_array[hash_algo];
    }

    extern void (*hw_mde_iv_init)(HW_MDE_ALGO algo, uint32_t *iv);
    extern void (*hw_mde_start)(MDE_CTX *ctx, HW_MDE_ALGO algo);
    extern bool (*hw_mde_update)(MDE_CTX *ctx, const uint8_t *input, uint32_t byte_len,
                                 HW_MDE_ACCESS_MODE access_mode);
    extern bool (*hw_mde_finish)(MDE_CTX *ctx, uint32_t *result, HW_MDE_ACCESS_MODE access_mode);

    void hw_mde_get_digest(HW_MDE_ALGO algo, uint32_t *output);
    void hw_mde_init(void);

#if MDE_SUPPORT_DMA_MODE == 1
    extern void (*hw_mde_dma_channel_init)(uint8_t dma_rx_ch_num);

    void hw_mde_set_dma_move_src(uint32_t src);
    void hw_mde_set_dma_current_update_remain_len(uint32_t size);
    bool hw_mde_dma_done(void);
#endif

#if MDE_SUPPORT_HMAC_MODE == 1
    void hw_mde_set_hmac_key(const uint8_t *key, uint32_t key_bits, uint8_t key_sel);
#endif

#ifdef __cplusplus
}
#endif
#endif /*__RTL876X_MERKLE_DAMGARD_ENGINE_H*/

